In [25]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [26]:
%sql postgresql://postgres:Omsairam123%40@localhost:5432/HRanalysis

In [28]:
%%sql 
select * from employees
limit 5

 * postgresql://postgres:***@localhost:5432/HRanalysis
5 rows affected.

[(65438, 'Sales & Marketing', 'region_7', "Master's & above", 'f', 'sourcing', 1, 35, 5, 8, 0, 49, 0),
 (65141, 'Operations', 'region_22', "Bachelor's", 'm', 'other', 1, 30, 5, 4, 0, 60, 0),
 (7513, 'Sales & Marketing', 'region_19', "Bachelor's", 'm', 'sourcing', 1, 34, 3, 7, 0, 50, 0),
 (2542, 'Sales & Marketing', 'region_23', "Bachelor's", 'm', 'other', 2, 39, 1, 10, 0, 50, 0),
 (48945, 'Technology', 'region_26', "Bachelor's", 'm', 'other', 1, 45, 3, 2, 0, 73, 0)]

### Lets check for duplicates

In [29]:
%%sql

SELECT employee_id,count(*)
FROM employees
GROUP BY employee_id
HAVING count(*) >1

 * postgresql://postgres:***@localhost:5432/HRanalysis
0 rows affected.

[]

### Lets check for missing values

In [31]:
%%sql 
SELECT *
FROM employees WHERE employee_id IS NULL or department IS NULL

 * postgresql://postgres:***@localhost:5432/HRanalysis
0 rows affected.

[]

### Lets explore the data

#### How many employees are there in each department?

In [33]:
%%sql

SELECT department,
       COUNT(DISTINCT employee_id) num_employees
FROM employees 
GROUP BY department
ORDER BY 2 DESC

 * postgresql://postgres:***@localhost:5432/HRanalysis
9 rows affected.

[('Sales & Marketing', 16840),
 ('Operations', 11348),
 ('Technology', 7138),
 ('Procurement', 7138),
 ('Analytics', 5352),
 ('Finance', 2536),
 ('HR', 2418),
 ('Legal', 1039),
 ('R&D', 999)]

#### How many employees were recruited through each recruitment channel?

In [34]:
%%sql

SELECT recruitment_channel,COUNT(DISTINCT employee_id) num_employees_rec
FROM employees 
GROUP BY recruitment_channel
ORDER BY 2 DESC

 * postgresql://postgres:***@localhost:5432/HRanalysis
3 rows affected.

[('other', 30446), ('sourcing', 23220), ('referred', 1142)]

#### What is the average age of employees in the company?

In [37]:
%%sql 
SELECT ROUND(AVG(age),0) avg_age
FROM employees

 * postgresql://postgres:***@localhost:5432/HRanalysis
1 rows affected.

[(Decimal('35'),)]

#### How many employees have received awards?

In [39]:
%%sql

SELECT count(*) awardees
FROM employees
WHERE awards_won=1

 * postgresql://postgres:***@localhost:5432/HRanalysis
1 rows affected.

[(1270,)]

#### %  employees  promoted?

In [49]:
%%sql

WITH total as (SELECT COUNT(DISTINCT employee_id) total_emp
FROM employees),
promoted as(SELECT COUNT(DISTINCT employee_id) promoted
            FROM employees
           WHERE is_promoted=1)
SELECT round((CAST (promoted AS DECIMAL)/CAST ((select total_emp FROM total) AS DECIMAL))*100,2) perc_emp_promoted
FROM promoted

 * postgresql://postgres:***@localhost:5432/HRanalysis
1 rows affected.

[(Decimal('8.52'),)]

#### What is the average training score for each department?

In [52]:
%%sql

SELECT department, round(AVG(avg_training_score),1) avg_training_score
FROM employees
GROUP BY department
ORDER BY 2 DESC

 * postgresql://postgres:***@localhost:5432/HRanalysis
9 rows affected.

[('Analytics', Decimal('84.6')),
 ('R&D', Decimal('84.6')),
 ('Technology', Decimal('79.9')),
 ('Procurement', Decimal('70.1')),
 ('Operations', Decimal('60.1')),
 ('Finance', Decimal('60.1')),
 ('Legal', Decimal('59.7')),
 ('Sales & Marketing', Decimal('50.4')),
 ('HR', Decimal('50.2'))]

#### What is the maximum length of service for male and female employees?

In [54]:
%%sql

SELECT CASE WHEN gender='f' THEN 'Female' ELSE 'Male' END gender,
        max(length_of_service) Service_in_mths
FROM employees
GROUP BY 1

 * postgresql://postgres:***@localhost:5432/HRanalysis
2 rows affected.

[('Female', 34), ('Male', 37)]

#### Which region has the highest number of employees?

In [57]:
%%sql

SELECT region,COUNT(DISTINCT employee_id) num_employees
FROM employees
GROUP BY 1 
ORDER BY 2 DESC
LIMIT 1

 * postgresql://postgres:***@localhost:5432/HRanalysis
1 rows affected.

[('region_2', 12343)]

#### How many employees have a rating of 4 or above in the previous year?

In [58]:
%%sql

SELECT count(*) total
FROM employees
WHERE previous_year_rating>4

 * postgresql://postgres:***@localhost:5432/HRanalysis
1 rows affected.

[(11741,)]

#### How many employees have a higher training score than the average training score in their department?

In [71]:
%%sql

WITH ats as (SELECT department dep, AVG(avg_training_score) training_score
FROM employees
GROUP BY department)

SELECT e.department,count(*)
FROM employees e
JOIN ats a ON e.department=a.dep AND e.avg_training_score>a.training_score
GROUP BY department

 * postgresql://postgres:***@localhost:5432/HRanalysis
9 rows affected.

[('R&D', 510),
 ('Finance', 656),
 ('Operations', 2946),
 ('HR', 888),
 ('Legal', 414),
 ('Analytics', 2725),
 ('Procurement', 2698),
 ('Sales & Marketing', 6326),
 ('Technology', 3731)]